Autodesk.Revit.DB.Electrical.ElectricalAnalyticalLoadSet.GetAnalyticalLoadScenariosData
Gets the electrical analytical load scenarios data.
Returns:
The electrical analytical load scenarios data.
Since:
2024

Autodesk.Revit.DB.Electrical.ElectricalAnalyticalLoadSet.GetLoadIds
Gets Equipment Load ids in the LoadSet.
Returns:
The Equipment Load ids.
Since:
2024

Autodesk.Revit.DB.Electrical.ElectricalAnalyticalLoadSet.Create(Autodesk.Revit.DB.Document,System.String)
Creates an electrical analytical load set.
document:
The document where the new element will be created.
name:
The name of new electrical analytical load set. The actual name may be post-fixed if already exists.
Returns:
The newly created electrical analytical loadset.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
name is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2024

Autodesk.Revit.DB.Electrical.ElectricalAnalyticalLoadSet.TotalQuantity
The total count of the Equipment Loads in the LoadSet.
Since:
2024

Autodesk.Revit.DB.Electrical.ElectricalAnalyticalLoadSet.QuantityOnStandBy
The number of Equipment Loads that are not operational at any time.
Remarks:
The equipment loads with smaller load value within the set are considered on standby.
Must be between 0 and (total count of the Equipment Loads in the LoadSet)
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The number is greater than the total count of the Equipment Loads in the LoadSet.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for number is negative.
Since:
2024

Autodesk.Revit.DB.Electrical.ElectricalAnalyticalLoadSet
Represents the electrical analytical load set, it can contain a set of Electrical Analytical Equipment Loads.
Since:
2024